Repository: MoazMuhammed/foodtrackerProject
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمه السر

source: UserName
ar: اسم المستخدم

source: Sign In
ar: تسجيل الدخول

source: Licenses
ar: صلاحيات

source: Welcome
ar: مرحباً بك

# enjoy
source: Enjoy Your Journey
ar: أستمتع برحلتك

# enterEmail
source: Enter Your Email
ar: أدخل البريد الإلكتروني

# enterUserName
source: Enter Your UserName
ar: أدخل اسم المستخدم

# enterPhone
source: Enter Your Phone
ar: أدخل رقم الهاتف

# enterConfirmPassword
source: Enter Your Confirm Password
ar: أدخل كلمه المرور التاكبدبة

# enterPassword
source: Enter Your password
ar: أدخل كلمه السر

# forgetPasswordLogin
source: Forget password?
ar: نسيت كلمه السر؟

# haveAcc
source: Do not have an Account?
ar: هل لديك حساب مسبقاً؟

source: Sign up
ar: قم بالتسجيل

source: Forget password
ar: تغير كلمه السر

# passwordSaved
source: Your New password Have Successful Saved
ar: كلمه السر الجديده الخاصه بك تم حفظها

source: Congratulation
ar: تهانياَ

source: Go to Home
ar: الذهاب للصفحه الرئيسية

# enterNewPassword
source: Please Enter Your New Password
ar: برجاءإدخال كلمه السر الجديدة

source: Confirm
ar: تأكيد

# otp
source: Please enter the 4 digit code that have been send to email
ar: برجاء إدخال 4 ارقام الذي تم إرسالها عبر البريد الإلكتروني

# enterEmailToReceiveCode
source: Please Enter Your Email To Receive The code
ar: الرجاء إدخال البريد الإلكتروني لإستلام الرمز الخاص بك

source: Send code
ar: إرسال الرمز

source: let's Get Started
ar: هيا بنا نبدأ

# onBoardTitleOne
source: always beside you
ar: دائما بجانبك

# onBoardDescriptionOne
source: In food tracker, We present a new vision for good programs by proving moral support to the family in caring for the allergies facing our children because they have become very widespread
ar: في تعقب الطعام ، نقدم رؤية جديدة لـبرامج جيدة من خلال إثبات الدعم المعنوي للأسرة في رعايةالحساسية التي تواجه الأطفال لأنهم أصبحوا جدا واسع الانتشار

# onBoardTitleTwo
source: We are here for you
ar: نحن هنا من أجلك

# onBoardDescriptionTwo
source: Program also provide ways to discover if your child suffers from allergies and also discover what type and methods of caring for them in addition to using artificial intelligence so that results are 98% correct
ar: يوفر البرنامج أيضًا طرقًا لاكتشاف ما إذا كان طفلك يعاني من الحساسية وأيضًا اكتشاف نوع وطرق العناية به بالإضافة إلى استخدام الذكاء الاصطناعي حتى تكون النتائج صحيحة بنسبة 98٪

# onBoardTitleThree
source: Provide medical support
ar: تقديم الدعم الطبي

# onBoardDescriptionThree
source: One of the best and most important features of food tracker is that here we always provide support in all cases so that parents feel safe because we are not only a medical program but we are family that always care for your safety
ar: من أفضل وأهم ميزات أداة تعقب الطعام لأننا هنا نقدم دائمًا الدعم في جميع الحالات حتى يشعر الآباء بالأمان لأننا لسنا برنامجًا طبيًا فقط ولكننا عائلة نهتم دائمًا بسلامتك

source: New password
ar: كلمه المرور الجديده

# confirmNewPassword
source: Confirm password
ar: تأكيد كلمه المرور الجديده

source: Follow
ar: متابعه

source: Search
ar: بحث

source: Home
ar: الرئيسيه

# allergy
source: Category
ar: حساسيه

source: FA Scanner
ar: ماسح

# cartAllergy
source: Product
ar: سله

source: Allergy Type
ar: أنواع الحساسية

# chooseService
source: Choose Service Of Process
ar: اختر خدمة العملية

# photoAnalysisNote
source: to get the type of allergy by analysis the photo using artificial intelligence.
ar: للحصول على نوع الحساسية من خلال تحليل الصورة باستخدام الذكاء الاصطناعي.

source: Medical Analysis
ar: تحاليل طبية

# medicalAnalysisNote
source: For get the result from medical reports like IGE
ar: للحصول على النتيجة من التقارير الطبية مثل IGE

source: Choose Type
ar: اختر النوع

source: Photo Analysis
ar: تحليل الصوره

source: Note
ar: تحذير

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Back
ar: الرجوع

source: Check Data
ar: تحقق من البيانات

# medicalAnalysisDescription
source: Medical Analyzes Are A Feature Provided By The Program So That The User Or Any Person Can View And Interpret The Results Of The Analyzes Without The Need For A Doctor
ar: التحليلات الطبية هي ميزة يقدمها البرنامج بحيث يمكن للمستخدم أو أي شخص الاطلاع على نتائج التحليلات وتفسيرها دون الحاجة إلى طبيب

source: Warning
ar: نحذير

# warningDescription
source: This result is not 100% correct. In the event that the symptoms were very serious, you should go to the nearest doctor or hospital.
ar: هذه النتيجة ليست صحيحة 100٪. في حال كانت الأعراض شديدة الخطورة عليك التوجه لأقرب طبيب أو مستشفى.

source: Start Now
ar: ابدأ الان

# enterIge
source: Enter IGE Total Number
ar: أدخل رقم IGE الإجمالي

source: Process Complete
ar: اكتملت العملية

# igeResult
source: IGE Total Results :
ar: إجمالي نتائج IGE:

source: You Are In :
ar: أنت في :

source: Warning Level
ar: مستوى التحذير

# warningLevelNote
source: It is not evidence of a specific disease.
ar: إنه ليس دليلاً على مرض معين.

source: Normal Level :
ar: المستوي الطبيعي :

source: Danger Level :
ar: مستوى الخطر :

# DangerLevelNote
source: It may be: allergic disorders - some types of infections - autoimmune diseases.
ar: قد يكون: اضطرابات الحساسية - بعض أنواع الالتهابات - أمراض المناعة الذاتية.

source: Create Post
ar: إنشاء منشور

source: Create
ar: إنشاء

# post
source: Show What's in your Mind ….
ar: أظهر ما يدور في ذهنك….

source: Video
ar: فيديو

source: Photo
ar: الصور

source: Light
ar: فاتح

source: Dark
ar: داكن

# comment
source: Comments
ar: تعليقات

# addComment
source: Add Comment for People
ar: اضف تعليق للأشخاص

source: Settings
ar: الإعدادات

source: Location
ar: الموقع

source: Contact Us
ar: اتصل بنا

source: Chat
ar: الدردشة

# contactUsTitle
source: Talk To Our Team
ar: تحدث إلى فريقنا

source: Follow US
ar: تابعنا

# contactUsDescription
source: The "Contact Us" functionality is commonly used in applications or websites to provide a means for users to get in touch with the organization or support team. It allows users to send inquiries, provide feedback, report issues, or seek assistance.
ar: تُستخدم وظيفة "اتصل بنا" بشكل شائع في التطبيقات أو مواقع الويب لتوفير وسيلة للمستخدمين للاتصال بالمنظمة أو فريق الدعم. يسمح للمستخدمين بإرسال استفسارات أو تقديم ملاحظات أو الإبلاغ عن المشكلات أو طلب المساعدة.

source: First Name
ar: الاسم الاول

source: Last Name
ar: الاسم الاخير

source: Email Address
ar: عنوان البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Your Message
ar: رسالتك

# yourMessageNote
source: Write Your Message Here
ar: اكتب رسالتك هنا

source: Send
ar: ارسال

source: Credit Card
ar: بطاقة إئتمان

source: Number
ar: الرقم

source: Expired Date
ar: انتهاء الصلاحيه

source: Card Holder
ar: حامل البطاقه

source: Validate
ar: تحقق

# creditCardWarn
source: Warning not to share bank account data and codes with any other parties.
ar: تحذير بعدم مشاركة بيانات ورموز الحساب المصرفي مع أي أطراف أخرى.

source: Help Center
ar: مركز المساعدة

# helpCenterTitle
source: How Can I Help You?
ar: كيف يمكنني مساعدتك

# helpCenterDescription
source: We are always here to help, and if you have a problem using the food tracker program, please contact us through either of these two methods.
ar: نحن دائمًا هنا للمساعدة ، وإذا كانت لديك مشكلة في استخدام برنامج تعقب الطعام ، فيرجى الاتصال بنا من خلال أي من هاتين الطريقتين.

# termsAndCondition
source: Terms Of Service
ar: شروط الخدمه

source: Introduction
ar: المقدمه

# introductionDescription
source: Welcome to our terms and conditions ("Terms"). These Terms are important and affect your legal rights, so please read them carefully.
ar: مرحبًا بك في الشروط والأحكام الخاصة بنا ("الشروط"). هذه الشروط مهمة وتؤثر على حقوقك القانونية ، لذا يرجى قراءتها بعناية.

source: Agreement To Terms
ar: الموافقة على الشروط

# agreementToTermsDescription
source: By accessing or using our Services, you agree to be bound by these Terms. If you do not agree to these Terms, you may not access or use the Services.
ar: من خلال الوصول إلى خدماتنا أو استخدامها ، فإنك توافق على الالتزام بهذه الشروط. إذا كنت لا توافق على هذه الشروط ، فلا يجوز لك الوصول إلى الخدمات أو استخدامها.

# updateToTermsDescription
source: We reserve the right to update or modify these Terms at any time without prior notice. Your use of the Services following any such modification constitutes your agreement to be bound by the modified Terms.
ar: نحتفظ بالحق في تحديث أو تعديل هذه الشروط في أي وقت دون إشعار مسبق. يشكل استخدامك للخدمات بعد أي تعديل من هذا القبيل موافقتك على الالتزام بالشروط المعدلة.

source: Update To Terms
ar: تحديث الشروط

source: LogOut
ar: تسجيل الخروج

source: Like
ar: أعجبني

source: Share
ar: مشاركة

# noComment
source: Sorry their is no comments for Now
ar: عذراَ لا يوجد تعليقات في الوقت الحالي

# onlyAdmin
source: only The Admins And Doctors can set a comment
ar: الأطباء و المتخصصين فقط لديهم صلاحيات لاضافه تعليق

source: Details :
ar: التفاصيل :

source: Symptoms and signs :
ar: الأعراض والعلامات :

source: Protection :
ar: الوقاية :

# iGENumber
source: Enter IGE Total Number
ar: أدخل رقم IGE الإجمالي

source: Process completed
ar: تم إتمام العملية

# iGEResult
source: IGE Total Results :
ar: إجمالي نتائج IGE :

# status
source: You Are In :
ar: حالتك الان :

source: Warming level :
ar: مستوى الاحترار :

source: IGE Total Levels :
ar: مستويات IGE الإجمالية :

# warmingLevelDescription
source: It may be: allergic disorders - some types of infections - autoimmune diseases.
ar: قد يكون: اضطرابات الحساسية - بعض أنواع الالتهابات - أمراض المناعة الذاتية.

# normalLevelDescription
source: It is not evidence of a specific disease.
ar: إنه ليس دليلاً على مرض معين.

source: Allergy Classes
ar: أقسام الحساسية

source: Recommended Products
ar: المنتجات الشائعة

source: Add to cart
ar: اضف الي السلة

source: Rate
ar: تقييم

source: Allergy Product Details
ar: تفاصيل منتجات الحساسية

source: Account
ar: الحساب

source: Edit Personal Information
ar: تحرير المعلومات الشخصية

# lang
source: Language
ar: تغيير اللغه

# updateourPicture
source: Update Your Picture
ar: قم بتحديث صورتك

source: Update
ar: تحديث

source: Name
ar: الأسم

source: Check Cart
ar: السلة

source: Order Summary
ar: ملخص الطلب

source: Subtotal
ar: المجموع الفرعي

source: Total
ar: مبلغ إجمالي

source: Grand Total
ar: المبلغ الكلي

source: Checkout
ar: الدفع

source: Owner Name
ar: اسم المشتري

source: Owner Telephone
ar: رقم المشتري

source: Address of shipment
ar: عنوان المشتري

source: Date of Delivery
ar: تاريخ التوصيل

source: Date of shipment
ar: تاريخ الشراء

source: Payment Method
ar: طريقة الدفع للمالك

# congDes
source: Your order has been done correctly
ar: تم تنفيذ طلبك بشكل صحيح

source: Posts
ar: منشورات

# postHint
source: Show What's in your Mind ….
ar: أظهر ما يدور في ذهنك….

# pic
source: Picture
ar: صورة

source: Wheat Allergy
ar: حساسية القمح

source: Milk Allergy
ar: حساسية الحليب

source: Egg Allergy
ar: حساسية البيض

source: Nuts Allergy
ar: حساسية المكسرات

source: Meat Allergy
ar: حساسية اللحوم

source: Fish Allergy
ar: حساسية الأسماك

# howToAnalysisFood
source: To See How To Analysis Food
ar: لمعرفة كيفية تحليل الغذاء

source: Quick Access
ar: الوصول السريع

# addToCartSuccessfully
source: Item added to cart successfully
ar: تم اضافه المنتج للسلة بنجاح
